package study0121;

public class JabaOp {

	public static void main(String[] args) {
		// 연산자 
		/* 사칙 연산자         | +, -, * , /(몫), % (나머지)
		 * 대입 연산자         | = (오른쪽에서 왼쪽에 대입-저장)
		 * 증감 연산자         | ++, -- (1씩 증가, 1씩 감소) 
		 * 복합 대입 연산자     | += , -= , *= , /= , %= (~해서 왼쪽에 저장)
		 * 비교 연산자         | >, < , >= , <= , == , !=
		 * 논리 연산자         | && (and), || (or), !| (not)  // | <-shift + \
		 * 조건 연산자(삼향연산자)| (조건식) ? 참일 경우 실행 내용 : 거짓일 경우 실행;
		 * 
		 * 비트연산자 (2진수를 계산하기 위한 연산자)
		 *    비트 논리연산자   | & , | , ~ , ^ (xor)
		 *    비트 쉬프트연산자  | << , >>
		 */
		
		

	}

}
